# ScheduleSortGroupField Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleSortGroupField Constructor
ScheduleSortGroupField Class See Also
---
Creates a new ScheduleSortGroupField.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ScheduleSortGroupField()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
ScheduleSortGroupField()
```

# See Also
ScheduleSortGroupField Class
ScheduleSortGroupField Overload
Autodesk.Revit.DB Namespace